In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
bronze=pd.read_csv('bronze_top5.csv')
silver=pd.read_csv('silver_top5.csv')

In [6]:
bronze['NOC']=['USA','SOV','UKD','FRA','GER']

In [7]:
bronze.head

<bound method NDFrame.head of           Country   Total  NOC
0   United States  1052.0  USA
1    Soviet Union   584.0  SOV
2  United Kingdom   505.0  UKD
3          France   475.0  FRA
4         Germany   454.0  GER>

In [8]:
bronze_cols=['NOC','Country','Total']
bronze=bronze[bronze_cols]
print(bronze)

   NOC         Country   Total
0  USA   United States  1052.0
1  SOV    Soviet Union   584.0
2  UKD  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

In [9]:
silver['NOC']=['USA','SOV','UKD','FRA','ITY']

In [10]:
silver_cols=['NOC','Country','Total']
silver=silver[silver_cols]
print(silver)

   NOC         Country   Total
0  USA   United States  1195.0
1  SOV    Soviet Union   627.0
2  UKD  United Kingdom   591.0
3  FRA          France   461.0
4  ITY           Italy   394.0

In [12]:
pd.merge(bronze,silver)

Empty DataFrame
Columns: [NOC, Country, Total]
Index: []

In [13]:
pd.merge(bronze,silver, on='NOC')

   NOC       Country_x  Total_x       Country_y  Total_y
0  USA   United States   1052.0   United States   1195.0
1  SOV    Soviet Union    584.0    Soviet Union    627.0
2  UKD  United Kingdom    505.0  United Kingdom    591.0
3  FRA          France    475.0          France    461.0

In [15]:
pd.merge(bronze,silver, on=['NOC','Country'])

   NOC         Country  Total_x  Total_y
0  USA   United States   1052.0   1195.0
1  SOV    Soviet Union    584.0    627.0
2  UKD  United Kingdom    505.0    591.0
3  FRA          France    475.0    461.0

In [16]:
pd.merge(bronze,silver,on=['NOC','Country'], suffixes=['_bronze_medals','_silver_medals'])

   NOC         Country  Total_bronze_medals  Total_silver_medals
0  USA   United States               1052.0               1195.0
1  SOV    Soviet Union                584.0                627.0
2  UKD  United Kingdom                505.0                591.0
3  FRA          France                475.0                461.0

In [17]:
pd.merge(bronze,silver,on=['NOC','Country'], suffixes=['_bronze_medals','_silver_medals'],how='inner')

   NOC         Country  Total_bronze_medals  Total_silver_medals
0  USA   United States               1052.0               1195.0
1  SOV    Soviet Union                584.0                627.0
2  UKD  United Kingdom                505.0                591.0
3  FRA          France                475.0                461.0

In [18]:
pd.merge(bronze,silver,on=['NOC','Country'], suffixes=['_bronze_medals','_silver_medals'],how='left')

   NOC         Country  Total_bronze_medals  Total_silver_medals
0  USA   United States               1052.0               1195.0
1  SOV    Soviet Union                584.0                627.0
2  UKD  United Kingdom                505.0                591.0
3  FRA          France                475.0                461.0
4  GER         Germany                454.0                  NaN